# **Project 3 - Part 3**
*   Iyadh Tajouri

---

# **Part 3**

Overview/Data Dictionary: https://www.imdb.com/interfaces/

# Specifications - Database
The stakeholder wants to take the data cleaned and collected in Parts 1 of the project and wants to create a MySQL database for them.

> Create a new MySQL database after preparing the data for a relational database.

> Export the database to a .sql file in your repository using MySQL Workbench.

The data from the following files included in the database :

* Title Basics:
  Movie ID (tconst)

  Primary Title

  Start Year

  Runtime (in Minutes)

  Genres

* Title Ratings:
  Movie ID (tconst)

  Average Movie Rating

  Number of Votes

* The TMDB API Results is excluded from Analysis

In [97]:
# Standards Librairies Import
import pandas as pd
import numpy as np

In [98]:
## Ignore warnings
import warnings
warnings.filterwarnings('ignore')

In [99]:
#from google.colab import drive
#drive.mount('/content/drive')

### Importing Title Ratings into Jupyter Notebook

In [100]:
# Load & read the saved file title_ratings
title_ratings = pd.read_csv("Data/ratings.csv.gz", low_memory = False)
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2003
1  tt0000002            5.8       269
2  tt0000005            6.2      2683
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [101]:
# Check title_ratings dataframe
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 512735 entries, 0 to 512734
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         512735 non-null  object
 1   averageRating  512735 non-null  float64
 2   numVotes       512735 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.7+ MB

### Importing Title Basics into Jupyter Notebook

In [102]:
# Load & read the saved file title_basics from "Data/" folder inside my repository
title_basics = pd.read_csv("Data/basics.csv.gz", low_memory = False)
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [103]:
# Check basics dataframe
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80699 entries, 0 to 80698
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          80699 non-null  object
 1   titleType       80699 non-null  object
 2   primaryTitle    80698 non-null  object
 3   originalTitle   80698 non-null  object
 4   isAdult         80699 non-null  int64
 5   startYear       80699 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  80699 non-null  int64
 8   genres          80699 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.5+ MB

# Required Transformation Steps for Title Basics

## **I) Normalize Genre**

### 1. Getting a list of unique genres

In [104]:
# create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [105]:
# use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama

In [106]:
# Save the list of unique genres sorted alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### 2. Create a new title_genres table

In [107]:
# Save just tconst and genres_split as new dataframe
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

### 3. Create a genre mapper dictionary to replace string genres with integers

In [108]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [109]:
# 3.
## Make a dictionary with the genre strings as the keys and the integers genre_ids as the values
## Make a dictionary with list of unique genres as the key and the new integer id as values
#genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
#genre_id_map

### 4. Replace the string genres in title_genres with the new integer ids

> **title_genres table :**

In [110]:
## Make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

* title_genres table is now ready for my MySQL database.

### 5. Convert the genre map dictionary into a dataframe

> **genres table :**

In [111]:
# Manually make dataframe with named cols from the .keys & .values
genres = pd.DataFrame({'genre_name': genre_map.keys(), 'genre_id': genre_map.values()}) # genre_lookup-----------------------
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

* genres table is all set for my MySQL database.

## Discard unnecessary information

In [112]:
# Check missing values
title_basics.isna().sum()

tconst                0
titleType             0
primaryTitle          1
originalTitle         1
isAdult               0
startYear             0
endYear           80699
runtimeMinutes        0
genres                0
genres_split          0
dtype: int64

For the title_basics table, drop the following columns :

* "original_title" (we will use the primary title column instead)
* "isAdult" ("Adult" will show up in the genres so this is redundant information).
* "titleType" (every row will be a movie).
* "genres" and other variants of genre ("genres_split") because genre is now represented in the 2 new tables described above.
* "endYear" with missing values.

> **title_basics table :**

In [113]:
# Drop the following columns :
title_basics=exploded_genres.drop(['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'], axis=1) # 'endYear'
# Convert the datatype from float to integer -------------------------------------------------------------------------------------
# title_basics['startYear'] = basics['startYear'].astype(int)
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
0,tt0035423,Kate & Leopold,2001,NaN,118
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0068865,Lives of Performers,2016,NaN,90

In [114]:
# Check title_basics dataframe after the required transformation steps for Title Basics
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 151295 entries, 0 to 80698
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          151295 non-null  object
 1   primaryTitle    151294 non-null  object
 2   startYear       151295 non-null  int64
 3   endYear         0 non-null       float64
 4   runtimeMinutes  151295 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 6.9+ MB

In [115]:
# Check for exact duplicates (rows)
title_basics.duplicated().sum()

70596

> **title_ratings table :**

In [116]:
# Check title_ratings
title_ratings.info()
title_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 512735 entries, 0 to 512734
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         512735 non-null  object
 1   averageRating  512735 non-null  float64
 2   numVotes       512735 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.7+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      2003
1  tt0000002            5.8       269
2  tt0000005            6.2      2683
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [117]:
# Check to see which data is duplicated
#basics[basics.duplicated(keep = False)]

In [118]:
# Drop duplicates using the drop() method
# basics.drop_duplicates(inplace = True)

In [119]:
# Check for remaining duplicated
#basics.duplicated().any()

## **II) Save the MySQL tables with tconst as the primary key**

In [120]:
# ! pip install PyMySQL

In [121]:
# Imports
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [122]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
db_name = "movies"
connection_movies = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
connection_movies

'mysql+pymysql://root:root@localhost/movies'

In [123]:
from urllib.parse import quote_plus
username = "root"
password = quote_plus("root") # Using the quote function to make the password compatible
db_name = "movies"

In [124]:
engine = create_engine(connection_movies)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [125]:
from sqlalchemy_utils import database_exists, create_database

In [126]:
## Check if database exists, if not, create it
if database_exists(connection_movies):
    print('It exists!')
else:
    create_database(connection_movies)
    print('Database created!')

It exists!

In [127]:
# To verify that the database was created
database_exists(connection_movies)

True

* Now we can go to MySQL workbench, and will see that the "movies" database is added to the list of schemas.

### Using tconst as the primary key

In [128]:
## If we had an integer id columns, this would be as simple as:
# Set the dataframe index and use index=True
# df.set_index('int_index').to_sql('table_name',engine,index=True)

> Set the Primary Key for each table created with pandas + sqlalchemy that is not a joiner table.

* for title_basics table (have a primary key): tconst is an object column
* for title_genres table (is a joiner table it does not have a primary key) : tcons is an object column
* for genres table (have a primary key): genre_id is an integer id column
* for title_ratings table (have a primary key): tcons is an object column

### 1. Creating a dataype schema for to_sql

In [129]:
# check .info()
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 151295 entries, 0 to 80698
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          151295 non-null  object
 1   primaryTitle    151294 non-null  object
 2   startYear       151295 non-null  int64
 3   endYear         0 non-null       float64
 4   runtimeMinutes  151295 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 6.9+ MB

In [130]:
# Check the dtypes of the title_basics dataframe
title_basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [131]:
# Get max string length for 'tconst'
max_str_len = title_basics['tconst'].fillna('').map(len).max()
max_str_len

10

In [132]:
# Get max string length for 'primaryTitle'
max_str_len = title_basics['primaryTitle'].fillna('').map(len).max()
max_str_len

242

In [133]:
## Creating a dataype schema of title_basics
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max() # a primary key
title_len = title_basics['primaryTitle'].fillna('').map(len).max() # non-key column
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}
title_basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Float(),
 'endYear': Float(),
 'runtimeMinutes': Integer()}

In [134]:
# check .info()
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Index: 151295 entries, 0 to 80698
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    151295 non-null  object
 1   genre_id  151295 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [135]:
# Check the dtypes of the title_genres dataframe
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [136]:
# Get max string length for 'tconst'
max_str_len = title_genres['tconst'].fillna('').map(len).max()
max_str_len

10

In [137]:
## Creating a dataype schema of title_genres : the joiner table
from sqlalchemy.types import *
## Calculate max string lengths for object columns
title_len = title_genres['tconst'].fillna('').map(len).max()  # not a primary key
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": Text(title_len+1),
    'genre_id':Integer()}
title_genres_schema

{'tconst': Text(length=11), 'genre_id': Integer()}

In [138]:
# check .info()
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [139]:
# Check the dtypes of the genres dataframe
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [140]:
# Get max string length for 'genre_name'
max_str_len = genres['genre_name'].fillna('').map(len).max()
max_str_len

10

In [141]:
## Creating a dataype schema of genres
from sqlalchemy.types import *
## Calculate max string lengths for object columns
title_len = genres['genre_name'].fillna('').map(len).max()  # non-key column
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "genre_name": Text(title_len+1),
    'genre_id':Integer()}
genres_schema

{'genre_name': Text(length=11), 'genre_id': Integer()}

In [142]:
# check .info()
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 512735 entries, 0 to 512734
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         512735 non-null  object
 1   averageRating  512735 non-null  float64
 2   numVotes       512735 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.7+ MB

In [143]:
# Check the dtypes of the title_ratings dataframe
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [144]:
# Get max string length for 'tconst'
max_str_len = title_ratings['tconst'].fillna('').map(len).max()
max_str_len

10

In [145]:
## Creating a dataype schema of title_ratings
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()  # a primary key
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_schema = {
    "tconst": String(key_len+1),
    'averageRating':Float(),
    'numVotes':Integer()}
title_ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

### 2. Run df.to_sql with the dtype argument

In [146]:
# Save to sql with dtype and index=False  -------------------------------------
#basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False) --------------------------------------

In [147]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics', engine, dtype=title_basics_schema, if_exists='replace', index=False)

151295

In [148]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

151295

In [149]:
# Save to sql with dtype and index=False
genres.to_sql('genres', engine, dtype=genres_schema, if_exists='replace', index=False)

25

In [150]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings', engine, dtype=title_ratings_schema, if_exists='replace', index=False)

512735

### Showing Tables

In [151]:
# Preview the names of all tables
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings

### Showing the first 5 rows of each table using SQL query

In [152]:
q= '''SELECT * FROM title_basics LIMIT 5'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0035423,Kate & Leopold,2001.0,None,118
2,tt0035423,Kate & Leopold,2001.0,None,118
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
4,tt0068865,Lives of Performers,2016.0,None,90

In [153]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

            Field         Type Null Key Default Extra
0          tconst  varchar(11)  YES        None
1    primaryTitle         text  YES        None
2       startYear        float  YES        None
3         endYear        float  YES        None
4  runtimeMinutes          int  YES        None

In [154]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes'],
      dtype=object)

In [155]:
q= '''SELECT * FROM title_genres LIMIT 5'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [156]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, engine)
describe

      Field      Type Null Key Default Extra
0    tconst  tinytext  YES        None
1  genre_id       int  YES        None

In [157]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'genre_id'], dtype=object)

In [158]:
q= '''SELECT * FROM genres LIMIT 5'''
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [159]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

        Field      Type Null Key Default Extra
0  genre_name  tinytext  YES        None
1    genre_id       int  YES        None

In [160]:
# Checking describe's Field names
describe['Field'].values

array(['genre_name', 'genre_id'], dtype=object)

In [161]:
q= '''SELECT * FROM title_ratings LIMIT 5'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2003
1  tt0000002            5.8       269
2  tt0000005            6.2      2683
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [162]:
q = '''DESCRIBE title_ratings;'''
describe = pd.read_sql(q, engine)
describe

           Field         Type Null Key Default Extra
0         tconst  varchar(11)  YES        None
1  averageRating        float  YES        None
2       numVotes          int  YES        None

In [163]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'averageRating', 'numVotes'], dtype=object)

### 3. Run the query to ADD PRIMARY KEY

* Use the sqlalchemy engine to update the tables and set the desired column as the primary key : title_genres table is a joiner table it does not have a primary key.

To add **Primary Key** to existing table in SQL:
You can use the ALTER statement to create a primary key.
However, the primary key can only be created on columns that are defined as **NOT NULL**.
You cannot create a primary key on a column that allows NULLs.

In [164]:
from sqlalchemy import Table
from sqlalchemy import Column
from sqlalchemy import inspect

In [165]:
inspector = inspect(engine)
# Get table information
print(inspector.get_table_names())
# Get column information
print(inspector.get_columns('title_basics'))

['genres', 'title_basics', 'title_genres', 'title_ratings']
[{'name': 'tconst', 'type': VARCHAR(length=11), 'default': None, 'comment': None, 'nullable': True}, {'name': 'primaryTitle', 'type': TEXT(), 'default': None, 'comment': None, 'nullable': True}, {'name': 'startYear', 'type': FLOAT(), 'default': None, 'comment': None, 'nullable': True}, {'name': 'endYear', 'type': FLOAT(), 'default': None, 'comment': None, 'nullable': True}, {'name': 'runtimeMinutes', 'type': INTEGER(), 'default': None, 'comment': None, 'nullable': True, 'autoincrement': False}]

In [166]:
## engine.execute('ALTER TABLE title_basics ALTER COLUMN tconst VARCHAR(10) NOT NULL;')

In [167]:
# Use the sqlalchemy engine to update the title_basics table and set 'tconst'column as the primary key
## engine.execute('ALTER TABLE title_basics ADD CONSTRAINT primary_key_alias Primary ADD PRIMARY KEY (''tconst'');')

In [168]:
# Use the sqlalchemy engine to update the title_basics table and set 'tconst'column as the primary key
## engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY ('tconst');')

----

In [169]:
# Use the sqlalchemy engine to update the genres table and set 'genre_id'column as the primary key
## engine.execute('ALTER TABLE genres ADD PRIMARY KEY ('genre_id');')

In [170]:
# Use the sqlalchemy engine to update the title_ratings table and set 'tconst'column as the primary key
## engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY ('tconst');')

In [171]:
##